garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F15Q40.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CWG1PPS" edc:nzwidth="8" edc:por="--000010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x25B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS5" edc:mask="0x1" edc:name="CWGINPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x3f" edc:name="CWG1INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS5" edc:mask="0x1" edc:name="CWG1INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x3f" edc:name="CWGINPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x25C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD1CARLPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD1CARLPPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x25E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MDCARLPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCARLPPS0" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS1" edc:mask="0x1" edc:name="MDCARLPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS2" edc:mask="0x1" edc:name="MDCARLPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS3" edc:mask="0x1" edc:name="MDCARLPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS4" edc:mask="0x1" edc:name="MDCARLPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS5" edc:mask="0x1" edc:name="MDCARLPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCARLPPS" edc:mask="0x3f" edc:name="MDCARLPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD1CARHPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD1CARHPPS" edc:nzwidth="8" edc:por="--010101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x25F">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MDCARHPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCARHPPS0" edc:mask="0x1" edc:name="MDCARHPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS1" edc:mask="0x1" edc:name="MDCARHPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS2" edc:mask="0x1" edc:name="MDCARHPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS3" edc:mask="0x1" edc:name="MDCARHPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS4" edc:mask="0x1" edc:name="MDCARHPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARHPPS5" edc:mask="0x1" edc:name="MDCARHPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCARHPPS" edc:mask="0x3f" edc:name="MDCARHPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD1SRCPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD1SRCPPS" edc:nzwidth="8" edc:por="--000001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x260">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MDSRCPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDSRCPPS0" edc:mask="0x1" edc:name="MDSRCPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS1" edc:mask="0x1" edc:name="MDSRCPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS2" edc:mask="0x1" edc:name="MDSRCPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS3" edc:mask="0x1" edc:name="MDSRCPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS4" edc:mask="0x1" edc:name="MDSRCPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDSRCPPS5" edc:mask="0x1" edc:name="MDSRCPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDSRCPPS" edc:mask="0x3f" edc:name="MDSRCPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="--000010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x261">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS0" edc:mask="0x1" edc:name="CLCIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS1" edc:mask="0x1" edc:name="CLCIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS2" edc:mask="0x1" edc:name="CLCIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS3" edc:mask="0x1" edc:name="CLCIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS4" edc:mask="0x1" edc:name="CLCIN0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS5" edc:mask="0x1" edc:name="CLCIN0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS" edc:mask="0x3f" edc:name="CLCIN0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
