garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F15Q40.PIC
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x307">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW8" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW9" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW10" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW11" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW12" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW13" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW14" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW15" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x308">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW16" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW17" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW18" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW19" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW20" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW21" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW22" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW23" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1PR" edc:desc="" edc:name="SMT1PR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x309">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT1PRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x309">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1PR" edc:desc="" edc:mask="0xff" edc:name="SMT1PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1PR0" edc:desc="" edc:mask="0x1" edc:name="SMT1PR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR1" edc:desc="" edc:mask="0x1" edc:name="SMT1PR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR2" edc:desc="" edc:mask="0x1" edc:name="SMT1PR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR3" edc:desc="" edc:mask="0x1" edc:name="SMT1PR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR4" edc:desc="" edc:mask="0x1" edc:name="SMT1PR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR5" edc:desc="" edc:mask="0x1" edc:name="SMT1PR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR6" edc:desc="" edc:mask="0x1" edc:name="SMT1PR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR7" edc:desc="" edc:mask="0x1" edc:name="SMT1PR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT1PRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x30A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1PR" edc:desc="" edc:mask="0xff" edc:name="SMT1PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1PR8" edc:desc="" edc:mask="0x1" edc:name="SMT1PR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR9" edc:desc="" edc:mask="0x1" edc:name="SMT1PR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR10" edc:desc="" edc:mask="0x1" edc:name="SMT1PR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR11" edc:desc="" edc:mask="0x1" edc:name="SMT1PR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR12" edc:desc="" edc:mask="0x1" edc:name="SMT1PR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR13" edc:desc="" edc:mask="0x1" edc:name="SMT1PR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR14" edc:desc="" edc:mask="0x1" edc:name="SMT1PR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR15" edc:desc="" edc:mask="0x1" edc:name="SMT1PR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
